[
  {
    "id": "person1",
    "name": "Md. Nurul Hoque",
    "fullName": "Md. Nurul Hoque, PMP®",
    "avatar": "./assets/images/testimonial/person1.jpg",
    "position": "Head of IT | SAP ERP | AWS Cloud | Project Management",
    "text": "Selim Ahmed is a hard working and very sincere team player. He is creative, energetic, solutions oriented and highly motivated with exceptional skills and he is a great net-worker and as a team member."
  },
  {
    "id": "person2",
    "name": "Md. Mahi Salman",
    "fullName": "Md. Mahi Salman",
    "avatar": "./assets/images/testimonial/person2.jpg",
    "position": "Senior Project Coordinator | AI Engineer | SAP FI/CO",
    "text": "Mr. Selim Ahmed is a great colleague who is willing to collaborate with others and work towards common goals with the best communication skill. He is very talented at developing and maintaining both the front-end and back-end of web applications using .NET technologies. He is open to feedback, shares ideas, and listens to others' input. He is able to maintain a positive attitude and energy and can create a pleasant work environment for everyone. He is respectful, maintains a positive work ethic, and exhibits strong problem-solving skills."
  },
  {
    "id": "person3",
    "name": "Ahsan Al Rupom",
    "fullName": "Ahsan Al Rupom",
    "avatar": "./assets/images/testimonial/person3.jpg",
    "position": "Senior Software Engineer | Agile Master | PSM I",
    "text": "I had the pleasure of working with Selim for a few years during our early stage of our career, collaborating on several projects. Selim’s biggest strength is his ability to deal with conflicting priorities in high-pressure situations. He never loses his cool which is one of the reasons he stands out as an passionate Software Engineer. I highly recommend Selim if you need to get the job done!"
  },
  {
    "id": "person4",
    "name": "Debbrath Debnath",
    "fullName": "Debbrath Debnath",
    "avatar": "./assets/images/testimonial/person4.jpg",
    "position": "ERP and Technical Lead | Project Management",
    "text": "Selim Ahmed is one of the most dependable and thoughtful professionals I’ve worked with. He is not only technically skilled but also brings emotional intelligence into his work. He communicates clearly, gives constructive feedback, and builds strong relationships with teammates. <br/><br/>He is highly proficient in ERP, Database design, API integration, AI Engineering and modern JavaScript frameworks.  <br/><br/>He communicates clearly, gives constructive feedback, and builds strong relationships with teammates. He has a great balance serious when it’s time to deliver, but also supportive and positive in day-to-day interactions. I absolutely recommend him to any organization that values both high performance and a positive, collaborative workplace."
  },
  {
    "id": "person10",
    "name": "Md. Sazzad Hossain",
    "fullName": "Md. Sazzad Hossain",
    "avatar": "./assets/images/testimonial/person10.jpg",
    "position": "Software Engineer | Avalanche Technologies Ltd",
    "text": "I’ve worked with Selim Ahmed and have always admired his technical expertise and adaptability. Starting from strong .NET development skills, he has quickly grown into AI, delivering impactful solutions with creativity and dedication. A true team player and problem solver."
  },
  {
    "id": "person11",
    "name": "Kazi Zuljalal Md. Maslinia",
    "fullName": "Kazi Zuljalal Md. Maslinia",
    "avatar": "./assets/images/testimonial/person11.jpg",
    "position": "Sr. Software Engineer | ASP.NET | Flutter | MSSQL | ERP | Software Architect",
    "text": "I’ve had the pleasure of working alongside Selim Ahmed, and he is an exceptional Software Analyst with strong problem-solving skills and a clear, strategic mindset. He approaches projects with professionalism, ensures smooth collaboration, and consistently delivers high-quality results. <br/><br/>He is also an inspiring mentor and team player, always supporting colleagues and sharing knowledge. His dedication to AI and continuous learning motivates everyone around him. <br/><br/>Selim is a highly reliable and forward-thinking professional who brings tremendous value to any team."
  },
  {
    "id": "person12",
    "name": "Somapti Alam",
    "fullName": "Somapti Alam",
    "avatar": "./assets/images/testimonial/person12.jpg",
    "position": "Software Engineer at Orion | CTM SAP HCM Module | IT Professional | Web Designer & Developer",
    "text": "I had the opportunity to work with Mr. Selim in the same team at Orion Group, and he has always impressed me with his deep technical expertise and strong leadership qualities. As a Senior .NET Core Developer, he consistently delivers high-quality solutions with clean architecture, thoughtful design, and excellent problem-solving skills. <br/><br/>Selim is also an exceptional team lead—supportive, patient, and always ready to guide others. His ability to break down complex problems and provide clear direction has been invaluable to the team. <br/><br/>He is reliable, professional, and highly dedicated to producing the best outcomes. I strongly recommend Selim for any senior engineering or leadership role. He would be a tremendous asset to any organization."
  },
  {
    "id": "person5",
    "name": "Md. Sazib Hosen",
    "fullName": "Md. Sazib Hosen",
    "avatar": "./assets/images/testimonial/person5.jpg",
    "position": "Programmer at Ministry of Environment, Forest and Climate Change, Bangladesh",
    "text": "I wholeheartedly recommend Selim Ahmed for any software engineering role. His technical expertise, problem-solving abilities, and dedication to excellence make him an invaluable asset to any team."
  },
  {
    "id": "person6",
    "name": "Mazharul Haque",
    "fullName": "Mazharul Haque SSYB™, PRC™, SFPC™",
    "avatar": "./assets/images/testimonial/person6.jpg",
    "position": "Google Certified PMP® | Deputy Project Manager | Pakiza Software Ltd.",
    "text": "Selim Ahmed was a fantastic person to work with, and is not only a multi-skilled and insightful colleague, but also an inspiring strategist. Very good person. Great employee with a very strong problem-solving skills."
  },
  {
    "id": "person7",
    "name": "Md. Nasir Uddin",
    "fullName": "Md. Nasir Uddin",
    "avatar": "./assets/images/testimonial/person7.jpg",
    "position": "Senior SQA Engineer - III | Kona SL",
    "text": "Selim Ahmed is a very hard-working person who can tackle any business problem. We have worked together on several projects, and I found him a highly skilled and dedicated professional. His expertise in the field of ASP.NET Core has helped our company immensely. But what makes him stand out is his willingness to help others. I am glad to have worked with him. I highly recommend him!"
  },
  {
    "id": "person8",
    "name": "Istiaq Haider",
    "fullName": "Istiaq Haider",
    "avatar": "./assets/images/testimonial/person8.jpg",
    "position": "SAP SuccessFactors Certified Consultant | Employee Central(EC)",
    "text": "Selim Ahmed Sir was a great professional to work with. We worked together at Orion Group and he helped me a lot to get started and also to understand internal processes. His work ethic is immaculate and so easy to work together with. He goes out of his way when you ask for some help and guidance."
  },
  {
    "id": "person9",
    "name": "Ishraq Sowad",
    "fullName": "Ishraq Sowad",
    "avatar": "./assets/images/testimonial/person9.jpg",
    "position": "Private Security Contractor | Business Development",
    "text": "Mr. Selim is an excellent individual, who always gives his best to understand exact user needs and deliver service accordingly."
  }
]